Revit 2027 API
PromptForFamilyInstancePlacementOptions Constructor
 Creates a new PromptForFamilyInstancePlacementOptions using default options.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PromptForFamilyInstancePlacementOptions()
Public Sub New
public:
PromptForFamilyInstancePlacementOptions()
new : unit -> PromptForFamilyInstancePlacementOptions
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
PromptForFamilyInstancePlacementOptions Overload
Autodesk.Revit.UI Namespace